from aiogram.types import ReplyKeyboardMarkup, KeyboardButton

from app.bots.user_tg_bot.keyboards.user.main_menu import main_menu_keyboard
from app.bots.user_tg_bot.messages.base import BaseMessage


class CityNotSupportedMessage(BaseMessage):
    _text = (
        "❌ К сожалению, город, который вы указали, пока не поддерживается нашим сервисом.\n\n"
        "Мы постепенно расширяем географию работы. Как только сервис станет доступен в вашем городе — мы сразу же вас уведомим! 🚗"
    )
    _reply_markup = main_menu_keyboard()


class AtuhSessionNotFoundErrorMessage(BaseMessage):
    _text = (
        "🔐 Требуется авторизация\n\n"
        "Для доступа к сервису такси необходимо подтвердить ваш номер телефона.\n\n"
        "Это обеспечивает:\n"
        "✅ Безопасность ваших поездок\n"
        "✅ Надежную связь с водителями\n"
        "✅ Защиту персональных данных\n\n"
        "Пожалуйста, предоставьте номер телефона для продолжения."
    )

    _reply_markup = ReplyKeyboardMarkup(
        keyboard=[
            [KeyboardButton(text="📱 Отправить номер телефона", request_contact=True)]
        ],
        resize_keyboard=True,
    )
