from aiogram.types import ReplyKeyboardMarkup, KeyboardButton, ReplyKeyboardRemove

from app.bots.user_tg_bot.keyboards.user.main_menu import main_menu_keyboard
from app.bots.user_tg_bot.messages.base import BaseMessage


class WelcomeMessage(BaseMessage):
    _text = (
        "🚖 Добро пожаловать в TaxiBot!\n"
        "Мы рады помочь вам быстро и удобно заказать такси прямо через Telegram. 🚕\n\n"
        "📋 Перед началом работы:\n"
        "Пожалуйста, пройдите небольшую авторизацию, чтобы мы могли обеспечить вам качественный сервис:"
    )


class AskPhoneNumberForAuthMessage(BaseMessage):
    _reply_markup = ReplyKeyboardMarkup(
        keyboard=[
            [KeyboardButton(text="📱 Отправить номер телефона", request_contact=True)]
        ],
        resize_keyboard=True,
    )

    def __init__(self, is_repeat: bool = False) -> None:
        self.is_repeat = is_repeat

    @property
    def text(self) -> str:
        if self.is_repeat:
            return (
                "📱 Пожалуйста, отправьте свой номер телефона\n\n"
                "Нам важно, чтобы вы отправили именно свой номер, нажимая на кнопку ниже.\n"
                "🔒 Ваши данные останутся конфиденциальными — они будут использоваться только для подтверждения вашей личности и связи с вами.\n\n"
                "‼️ Обратите внимание:\n"
                "Если вы отправите чужой номер вручную, мы не сможем подтвердить вашу личность, и доступ к сервису может быть ограничен.\n\n"
                "🙏 Нажмите на кнопку ниже, чтобы быстро и безопасно поделиться вашим номером."
            )

        return (
            "Для продолжения работы нужен ваш номер телефона 📱\n\n"
            "Пожалуйста, отправьте его, нажав кнопку ниже 👇"
        )


class AskNameForAuthMessage(BaseMessage):
    _text = (
        "👤 Введите ваше имя\n\n"
        "Пожалуйста укажите как к вам обращаться\n"
        "Это нужно для комфортного общения с водителем"
    )

    _reply_markup = ReplyKeyboardRemove()


class RegisterSuccessfulMessage(BaseMessage):
    _text = (
        "🎉 Регистрация завершена!\n\n"
        "Поздравляем, вы успешно прошли регистрацию и теперь можете начать заказывать водителей! 🚗💨\n\n"
        "Чтобы заказать поездку, просто нажмите кнопку и следуйте инструкциям. Мы подберем для вас лучшего водителя!\n\n"
        "Если возникнут вопросы, не стесняйтесь обращаться — мы всегда на связи.\n\n"
        "Желаем приятных поездок! 🛣️"
    )

    _reply_markup = main_menu_keyboard()


class ReloadBotMessage(BaseMessage):
    _text = "Бот перезапущен."
    _reply_markup = main_menu_keyboard()


class SuccessfulAuthMessage(BaseMessage):
    _text = "👋 С возвращением!\n\nОтлично, вы снова в системе!"
    _reply_markup = main_menu_keyboard()
